data/defaults/constant/turbulenceProperties
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

%{%(physics/Turbulence%)
%:RANS
simulationType RAS;

RAS
{
    RASModel            %(physics/TurbulenceModel%);

    turbulence          on;

    printCoeffs         on;
}
%:LES
simulationType LES;

LES
{
    LESModel            %(physics/TurbulenceModel%);

    turbulence          on;

    printCoeffs         on;

%{%(physics/TurbulenceModel%)
%:Smagorinsky kEqn WALE
	delta           vanDriest;

    %[constant/_turbulenceProperties_LES%]
%}
}
%:default
simulationType laminar;
%}
