data/defaults/system/createPatchDict
%[_header%]
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
%{%(createPatches%)
%{%(boundaries/%(0%)/BoundaryType%)
%:baffle
%:default
    {
        name %(0%);
        patchInfo
        {
            type %(createPatches/%(0%)/PatchType%);
        }
        constructFrom patches;
        patches ( %(createPatches/%(0%)/PatchNamesList%) );
    }

%}
%}

%{%(createPatchesFromSnappyBaffles%)
%:True
%{%(createPatchesSnappyBaffles%)
    {
        name %(0%)_master;
        patchInfo
        {
            type cyclic;
            matchTolerance 1e-04;
            neighbourPatch %(0%)_slave;
        }

        constructFrom patches;
        patches ( %(createPatchesSnappyBaffles/%(0%)/PatchNamesList%) );
    }

    {
        name %(0%)_slave;
        patchInfo
        {
            type cyclic;
            matchTolerance 1e-04;
            neighbourPatch %(0%)_master;
        }

        constructFrom patches;
        patches ( %(createPatchesSnappyBaffles/%(0%)/PatchNamesListSlave%) );
    }

%}
%}
);


// ************************************************************************* //
